-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/TimWArthur/Documents/CAnD3/data_activity.log
  log type:  text
 opened on:  23 Sep 2022, 12:34:07

. set more off

. 
. ****Cleaning data****
. 
. ***Creating hh labor variable***
. 
. tab com_110

    COM_110 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,674       17.83       17.83
          2 |      2,414       11.72       29.55
          3 |      4,731       22.96       52.51
          4 |        375        1.82       54.33
          6 |      9,226       44.78       99.12
          7 |        117        0.57       99.68
          8 |         11        0.05       99.74
          9 |         54        0.26      100.00
------------+-----------------------------------
      Total |     20,602      100.00

. clonevar hhlabor = com_110

. recode hhlabor 4/9=.
(hhlabor: 9783 changes made)

. recode hhlabor 1/2 = 0
(hhlabor: 6088 changes made)

. recode hhlabor 3 =1
(hhlabor: 4731 changes made)

. label define hhlabor 0 "Mostly one Person" 1 "Equal"

. label values hhlabor hhlabor

. tab hhlabor

          COM_110 |      Freq.     Percent        Cum.
------------------+-----------------------------------
Mostly one Person |      6,088       56.27       56.27
            Equal |      4,731       43.73      100.00
------------------+-----------------------------------
            Total |     10,819      100.00

. 
. ***Creating education variable***
. 
. tab ehg3_01b

   EHG3_01B |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,036       14.74       14.74
          2 |      4,848       23.53       38.27
          3 |      1,483        7.20       45.47
          4 |      4,566       22.16       67.63
          5 |        732        3.55       71.18
          6 |      3,753       18.22       89.40
          7 |      1,843        8.95       98.34
         97 |         77        0.37       98.72
         98 |         58        0.28       99.00
         99 |        206        1.00      100.00
------------+-----------------------------------
      Total |     20,602      100.00

. clonevar edu = ehg3_01b

. recode edu 1/2 = 1
(edu: 4848 changes made)

. recode edu 3/5 = 2
(edu: 6781 changes made)

. recode edu 6 = 3
(edu: 3753 changes made)

. recode edu 7 = 4
(edu: 1843 changes made)

. recode edu 96/99 = .
(edu: 341 changes made)

. label define edu 1 "HS or less" 2 "Some College/Certificate" 3 "Bachelors" 4 "Professional Degree"

. label values edu edu

. tab edu

                EHG3_01B |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
              HS or less |      7,884       38.91       38.91
Some College/Certificate |      6,781       33.47       72.38
               Bachelors |      3,753       18.52       90.90
     Professional Degree |      1,843        9.10      100.00
-------------------------+-----------------------------------
                   Total |     20,261      100.00

. 
. ***Creating missings variable***
. 
. egen missing = rowmiss(hhlabor edu)

. 
. ***Creating table of descriptives***
. 
. tab edu hhlabor if missing==0

                      |        COM_110
             EHG3_01B | Mostly on      Equal |     Total
----------------------+----------------------+----------
           HS or less |     2,135      1,376 |     3,511 
Some College/Certific |     2,160      1,651 |     3,811 
            Bachelors |     1,161      1,072 |     2,233 
  Professional Degree |       537        543 |     1,080 
----------------------+----------------------+----------
                Total |     5,993      4,642 |    10,635 

. 
. ***Running regression***
. 
. logit hhlabor i.edu

Iteration 0:   log likelihood = -7285.5769  
Iteration 1:   log likelihood = -7253.0505  
Iteration 2:   log likelihood = -7253.0458  
Iteration 3:   log likelihood = -7253.0458  

Logistic regression                             Number of obs     =     10,635
                                                LR chi2(3)        =      65.06
                                                Prob > chi2       =     0.0000
Log likelihood = -7253.0458                     Pseudo R2         =     0.0045

-------------------------------------------------------------------------------------------
                  hhlabor |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
                      edu |
Some College/Certificate  |   .1705589   .0475792     3.58   0.000     .0773052    .2638125
               Bachelors  |   .3595303   .0546744     6.58   0.000     .2523704    .4666901
     Professional Degree  |   .4503971   .0699925     6.43   0.000     .3132144    .5875799
                          |
                    _cons |  -.4392859   .0345706   -12.71   0.000    -.5070431   -.3715287
-------------------------------------------------------------------------------------------

. logit hhlabor i.edu, or

Iteration 0:   log likelihood = -7285.5769  
Iteration 1:   log likelihood = -7253.0505  
Iteration 2:   log likelihood = -7253.0458  
Iteration 3:   log likelihood = -7253.0458  

Logistic regression                             Number of obs     =     10,635
                                                LR chi2(3)        =      65.06
                                                Prob > chi2       =     0.0000
Log likelihood = -7253.0458                     Pseudo R2         =     0.0045

-------------------------------------------------------------------------------------------
                  hhlabor | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
                      edu |
Some College/Certificate  |   1.185967   .0564274     3.58   0.000     1.080372    1.301884
               Bachelors  |   1.432656   .0783296     6.58   0.000     1.287073    1.594707
     Professional Degree  |   1.568935   .1098137     6.43   0.000     1.367815    1.799628
                          |
                    _cons |   .6444965   .0222806   -12.71   0.000     .6022738    .6896792
-------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/TimWArthur/Documents/CAnD3/data_activity.log
  log type:  text
 closed on:  23 Sep 2022, 12:34:08
-------------------------------------------------------------------------------------------------------------------------
